In [1]:
import pandas

In [7]:
dataset = pandas.read_csv("banklist.csv")

In [11]:
import pandas as pd

In [13]:
dataset = pd.read_csv("banklist.csv")

In [17]:
dataset.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,26-Jul-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,26-Jul-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,26-Jul-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

In [21]:
pd.set_option('display.max_columns', None)  # Show all columns
dataset.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,26-Jul-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,26-Jul-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,26-Jul-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

In [23]:
#How many States (ST) are represented in this data set?
num_states = dataset["ST"].nunique()
print("Number of unique states:", num_states)

Number of unique states: 44

In [25]:
#) Get a list or array of all the states in the data set.

unique_states_list = dataset["ST"].unique().tolist()
print(unique_states_list)

['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO', 'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX', 'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA', 'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI']

In [27]:
#What are the top 5 states with the most failed banks?
top_states = dataset["ST"].value_counts().head(5)
print(top_states)

ST
GA    93
FL    75
IL    68
CA    41
MN    23
Name: count, dtype: int64

In [29]:
#What are the top 5 acquiring institutions?
top_acquirers = dataset["Acquiring Institution"].value_counts().head(5)
print(top_acquirers)

Acquiring Institution
No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: count, dtype: int64

In [31]:
#How many banks has the State Bank of Texas acquired? How many of
#them were actually in Texas?
sbt_acquisitions = dataset[dataset["Acquiring Institution"] == "State Bank of Texas"]
num_acquired = sbt_acquisitions.shape[0]  # Count rows
print("Total banks acquired by State Bank of Texas:", num_acquired)

Total banks acquired by State Bank of Texas: 3

In [33]:
#
california_banks = dataset[dataset["ST"] == "CA"]  # Filter for California
most_common_city = california_banks["City"].value_counts().idxmax()  # Get most common city
print("Most common city for bank failures in California:", most_common_city)

Most common city for bank failures in California: Los Angeles